lab08/requests/payments/paymentsForEvent.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="pl/pwr/java/lab8/soap">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:fetchPaymentsForEventRequest>
            <eventId>0</eventId>
            <page>0</page>
        </gs:fetchPaymentsForEventRequest>
    </soapenv:Body>
</soapenv:Envelope>